### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # cloudflare_pages_domain.seichi_portal_domain will be created
+   resource "cloudflare_pages_domain" "seichi_portal_domain" {
+       account_id   = "9e9e88e2b19878c4a911c3c8a715a168"
+       domain       = "portal.seichi.click"
+       id           = (known after apply)
+       project_name = "seichi-portal"
+       status       = (known after apply)
    }

  # cloudflare_pages_project.seichi_portal will be created
+   resource "cloudflare_pages_project" "seichi_portal" {
+       account_id        = "9e9e88e2b19878c4a911c3c8a715a168"
+       created_on        = (known after apply)
+       domains           = (known after apply)
+       id                = (known after apply)
+       name              = "seichi-portal"
+       production_branch = "main"
+       subdomain         = (known after apply)

+       build_config {
+           build_command   = "yarn build"
+           destination_dir = "out"
+           root_dir        = "/"
        }

+       deployment_configs {
+           preview {
+               always_use_latest_compatibility_date = false
+               compatibility_date                   = (known after apply)
+               compatibility_flags                  = (known after apply)
+               fail_open                            = false
+               usage_model                          = "bundled"
            }

+           production {
+               always_use_latest_compatibility_date = false
+               compatibility_date                   = (known after apply)
+               compatibility_flags                  = (known after apply)
+               environment_variables                = {
+                   "NEXT_PUBLIC_BACKEND_API_URL"     = (sensitive)
+                   "NEXT_PUBLIC_MS_APP_CLIENT_ID"    = (sensitive)
+                   "NEXT_PUBLIC_MS_APP_REDIRECT_URL" = "https://portal.seichi.click"
+                   "NODE_ENV"                        = "production"
                }
+               fail_open                            = false
+               usage_model                          = "bundled"
            }
        }

+       source {
+           type = "github"

+           config {
+               deployments_enabled           = true
+               owner                         = "GiganticMinecraft"
+               pr_comments_enabled           = true
+               preview_deployment_setting    = "all"
+               production_branch             = "main"
+               production_deployment_enabled = true
+               repo_name                     = "seichi-portal-frontend"
            }
        }
    }

  # cloudflare_record.portal will be updated in-place
!   resource "cloudflare_record" "portal" {
        id              = "81784b1c8b1e599f0a1730092df1e819"
        name            = "portal"
        tags            = []
!       value           = "giganticminecraft.github.io" -> "seichi-portal.pages.dev"
        # (10 unchanged attributes hidden)
    }

  # helm_release.onp_cluster_argocd will be updated in-place
!   resource "helm_release" "onp_cluster_argocd" {
        id                         = "argocd"
        name                       = "argocd"
!       status                     = "failed" -> "deployed"
        # (27 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```
</details>